[{"filePath":"about","content":"---\npath: about\ncat: aboutLandingPage\n---\n\nMy name is Dave Jones and I'm a front-end web developer from Montreal,Canada. I make web development video tutorials."},{"filePath":"index","content":"---\npath: Home\ncat: LandingPage\n---\n\n\nThis is pretty awesome"},{"filePath":"jobs","content":"---\ntitle: Careers at USC Research Computing\npath: /about/jobs\ncat: jobs\nparentEle: About\n---\n\nAvalabile jobs"},{"filePath":"user-guides","content":"---\nid: 1\npath: user-guides\ncat: userGuidesLandingPage\ntitle: User Guides\nrouteCat: route\nroute: User Support\nroutePath: user-support\n---\n\nOur user guides are designed to provide comprehensive, step-by-step instructions for a variety of scientific computing tasks. For more personalized support, please see our User Support and Customized Research Partnerships pages.\n"},{"filePath":"user-support","content":"---\npath: user_support_landing_page\ncat: userSupportLandingPage\nroute: User Support\nroutePath: user-support\n---\n**Office Hours**: Office hours are an opportunity for CARC users to ask questions about anything CARC-related. No appointments are necessary, and all levels of users and questions are welcomed. Office hours are typically held weekly at the University Park campus (UPC) and twice a month at the Health Sciences campus (HSC).\n\n**Currently, all office hours are taking place via Zoom every Tuesday from 2:30-5:00 pm.** Zoom meeting information for office hours is included in the monthly activity calendar email that all CARC users receive. If you are unable to find this calendar, please email hpc-support@usc.edu for assistance.\n\n**Consultations**: Consultations for CARC account holders are available outside of regularly scheduled office hours. These are recommended for:\n\n - New condo owners, research groups, and instructors who wish to explore the CARC's services.\n - CARC users who have a complex and/or time-critical problem that is best resolved with a (virtual) face-to-face meeting.\n - Users who cannot attend the regularly scheduled office hours.\n\nIf you'd like to request a consultation, please fill out a [consultation request](https://usc.qualtrics.com/jfe/form/SV_cYiW9xq8lug7yjb). Currently, all consultations are taking place via Zoom.\n"},{"filePath":"high-performance-computing","content":"---\nid: 2\npath: high-performance-computing\ncat: highPerformanceComputingLandingPage\nrouteCat: route\nroute: User Guides\nroutePath: user-information/user-guides\n---\n\nOur user guides are designed to provide comprehensive, step-by-step instructions for a variety of scientific computing tasks. For more personalized support, please see our User Support and Customized Research Partnerships pages.\n\n"}]