[{"id":1587604740,"title":"HPC Leadership","author":"Yaseen A","date":"April 22, 2020","time":"18:19","content":"### Byoung-Do (BD) Kim\n\n![](/images/gatsby-astronaut.png)\n\n*Director, Center for High-Performance Computing...*\n\n*Author/ yaseen*\n\n<section id=\"content_main\" class=\"content_main grid_9\">\n     <div class=\"content_padding\">\n        <div class=\"paragraph-1\" style=\"display: flex\">\n            <p>BD joined USC’s Information Technology Services (ITS) in August 2019 to lead the USC Center for High-Performance Computing (HPC). He received his PhD in aeronautics and astronautics engineering from Purdue University and has been working in high-performance computing and big data fields for more than 15 years. Prior to joining USC, he worked at many national institutions such as the National Center for Supercomputing Applications (NCSA) and the Texas Advanced Computing Center (TACC) as a computational scientist and programmer and led advanced research computing programs at multiple R1 universities including Harvard Medical School and Virginia Tech.</p>\n        </div>\n        <p>BD’s research interests are large-scale application optimization, parallel computational models, and computational fluid dynamics. Recently, his focus has been extended to data-intensive computing and advanced system design for computation and data convergence models. He always looks for opportunities where the USC HPC team can maximize the potential of computational and data-enabled research by providing expertise in advanced computing and big data analysis...</p>\n    </div>\n</section>"},{"id":1586544600,"title":"This is a Test","author":"Yaseen Alkhafaji","date":"April 10, 2020","time":"11:50","content":"\n# This is just a test post\n\n*Let's see what happens.*\n"},{"id":1578237480,"title":"Now Publishing With Netlify CMS!","author":"Yaseen Alkhafaj","date":"January 05, 2020","time":"07:18","content":"We're now publishing remotely. Calling on all who would like to contribute to my blog!"},{"id":946713600,"title":"Cats are cute","author":"No author given","date":"undefined undefined, undefined","content":"Cats and Dogs are super cute"}]